jonahn/EE478/Lab2/h/p18f14k22lin.h
/*-------------------------------------------------------------------------
 * PIC18F14K22LIN processor header
 *
 * This software is developed by Microchip Technology Inc. and its
 * subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are 
 * met:
 * 
 * 1.      Redistributions of source code must retain the above copyright
 *         notice, this list of conditions and the following disclaimer.
 * 2.      Redistributions in binary form must reproduce the above 
 *         copyright notice, this list of conditions and the following 
 *         disclaimer in the documentation and/or other materials provided 
 *         with the distribution.
 * 3.      Microchip's name may not be used to endorse or promote products
 *         derived from this software without specific prior written 
 *         permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR PURPOSE ARE DISCLAIMED. IN NO EVENT 
 * SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR 
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
 * ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 * (c) Copyright 1999-2013 Microchip Technology, All rights reserved
 *-------------------------------------------------------------------------*/

#ifndef __18F14K22LIN_H
#define __18F14K22LIN_H

extern volatile near unsigned char       SRCON0;
extern volatile near union {
  struct {
    unsigned SRPR:1;
    unsigned SRPS:1;
    unsigned SRNQEN:1;
    unsigned SRQEN:1;
    unsigned SRCLK:3;
    unsigned SRLEN:1;
  };
  struct {
    unsigned :4;
    unsigned SRCLK0:1;
    unsigned SRCLK1:1;
    unsigned SRCLK2:1;
  };
} SRCON0bits;
extern volatile near unsigned char       SRCON1;
extern volatile near struct {
  unsigned SRRC1E:1;
  unsigned SRRC2E:1;
  unsigned SRRCKE:1;
  unsigned SRRPE:1;
  unsigned SRSC1E:1;
  unsigned SRSC2E:1;
  unsigned SRSCKE:1;
  unsigned SRSPE:1;
} SRCON1bits;
extern volatile near unsigned char       CM2CON0;
extern volatile near union {
  struct {
    unsigned C2CH:2;
    unsigned C2R:1;
    unsigned C2SP:1;
    unsigned C2POL:1;
    unsigned C2OE:1;
    unsigned C2OUT:1;
    unsigned C2ON:1;
  };
  struct {
    unsigned C2CH0:1;
    unsigned C2CH1:1;
  };
} CM2CON0bits;
extern volatile near unsigned char       CM2CON1;
extern volatile near struct {
  unsigned C2SYNC:1;
  unsigned C1SYNC:1;
  unsigned C2HYS:1;
  unsigned C1HYS:1;
  unsigned C2RSEL:1;
  unsigned C1RSEL:1;
  unsigned MC2OUT:1;
  unsigned MC1OUT:1;
} CM2CON1bits;
extern volatile near unsigned char       CM1CON0;
extern volatile near union {
  struct {
    unsigned C1CH:2;
    unsigned C1R:1;
    unsigned C1SP:1;
    unsigned C1POL:1;
    unsigned C1OE:1;
    unsigned C1OUT:1;
    unsigned C1ON:1;
  };
  struct {
    unsigned C1CH0:1;
    unsigned C1CH1:1;
  };
} CM1CON0bits;
extern volatile near unsigned char       SSPMSK;
extern volatile near union {
  struct {
    unsigned MSK:8;
  };
  struct {
    unsigned MSK0:1;
    unsigned MSK1:1;
    unsigned MSK2:1;
    unsigned MSK3:1;
    unsigned MSK4:1;
    unsigned MSK5:1;
    unsigned MSK6:1;
    unsigned MSK7:1;
  };
} SSPMSKbits;
extern volatile near unsigned char       SLRCON;
extern volatile near struct {
  unsigned SLRA:1;
  unsigned SLRB:1;
  unsigned SLRC:1;
} SLRCONbits;
extern volatile near unsigned char       WPUA;
extern volatile near union {
  struct {
    unsigned WPUA:6;
  };
  struct {
    unsigned WPUA0:1;
    unsigned WPUA1:1;
    unsigned WPUA2:1;
    unsigned WPUA3:1;
    unsigned WPUA4:1;
    unsigned WPUA5:1;
  };
} WPUAbits;
extern volatile near unsigned char       WPUB;
extern volatile near union {
  struct {
    unsigned :4;
    unsigned WPUB:4;
  };
  struct {
    unsigned :4;
    unsigned WPUB4:1;
    unsigned WPUB5:1;
    unsigned WPUB6:1;
    unsigned WPUB7:1;
  };
} WPUBbits;
extern volatile near unsigned char       IOCA;
extern volatile near union {
  struct {
    unsigned IOCA:6;
  };
  struct {
    unsigned IOCA0:1;
    unsigned IOCA1:1;
    unsigned IOCA2:1;
    unsigned IOCA3:1;
    unsigned IOCA4:1;
    unsigned IOCA5:1;
  };
} IOCAbits;
extern volatile near unsigned char       IOCB;
extern volatile near union {
  struct {
    unsigned :4;
    unsigned IOCB:4;
  };
  struct {
    unsigned :4;
    unsigned IOCB4:1;
    unsigned IOCB5:1;
    unsigned IOCB6:1;
    unsigned IOCB7:1;
  };
} IOCBbits;
extern volatile near unsigned char       ANSEL;
extern volatile near union {
  struct {
    unsigned ANSEL:8;
  };
  struct {
    unsigned ANS0:1;
    unsigned ANS1:1;
    unsigned ANS2:1;
    unsigned ANS3:1;
    unsigned ANS4:1;
    unsigned ANS5:1;
    unsigned ANS6:1;
    unsigned ANS7:1;
  };
  struct {
    unsigned ANSEL0:1;
    unsigned ANSEL1:1;
    unsigned ANSEL2:1;
    unsigned ANSEL3:1;
    unsigned ANSEL4:1;
    unsigned ANSEL5:1;
    unsigned ANSEL6:1;
    unsigned ANSEL7:1;
  };
} ANSELbits;
extern volatile near unsigned char       ANSELH;
extern volatile near union {
  struct {
    unsigned ANSELH:4;
  };
  struct {
    unsigned ANS8:1;
    unsigned ANS9:1;
    unsigned ANS10:1;
    unsigned ANS11:1;
  };
  struct {
    unsigned ANSEL8:1;
    unsigned ANSEL9:1;
    unsigned ANSEL10:1;
    unsigned ANSEL11:1;
  };
} ANSELHbits;
extern volatile near unsigned char       PORTA;
extern volatile near union {
  struct {
    unsigned RA0:1;
    unsigned RA1:1;
    unsigned RA2:1;
    unsigned RA3:1;
    unsigned RA4:1;
    unsigned RA5:1;
  };
  struct {
    unsigned AN0:1;
    unsigned AN1:1;
    unsigned AN2:1;
    unsigned MCLR:1;
    unsigned AN3:1;
    unsigned T13CKI:1;
  };
  struct {
    unsigned CVREF:1;
    unsigned C12IN0M:1;
    unsigned C1OUT:1;
    unsigned NOT_MCLR:1;
    unsigned OSC2:1;
    unsigned OSC1:1;
  };
  struct {
    unsigned VREFM:1;
    unsigned VREFP:1;
    unsigned T0CKI:1;
    unsigned :1;
    unsigned CLKOUT:1;
    unsigned CLKIN:1;
  };
  struct {
    unsigned INT0:1;
    unsigned INT1:1;
    unsigned INT2:1;
  };
  struct {
    unsigned PGD:1;
    unsigned PGC:1;
    unsigned :1;
    unsigned VPP:1;
  };
  struct {
    unsigned C1INP:1;
    unsigned :1;
    unsigned SRQ:1;
  };
} PORTAbits;
extern volatile near unsigned char       PORTB;
extern volatile near union {
  struct {
    unsigned :4;
    unsigned RB4:1;
    unsigned LINRX:1;
    unsigned LINCS:1;
    unsigned LINTX:1;
  };
  struct {
    unsigned :4;
    unsigned AN10:1;
    unsigned RB5:1;
    unsigned RB6:1;
    unsigned RB7:1;
  };
} PORTBbits;
